package condition.util;

public class Messages {

    private Messages() {
    }

    public static final String IS_NAME = "ИС \"Сервисная деятельность\"";
    public static final String TC_SERVICE_NAME = "\"Выдача технических условий, акта разграничения балансовой принадлежности электрических сетей и эксплуатационной ответственности сторон со схемой подключения потребителя\"";
    public static final String DOC_REASONED_REFUSAL = "\"Мотивированное письмо\"";
    public static final String DOC_TC_PROJECT = "\"Технические условия на присоединение к электрическим сетям\"";

    // TO EMPLOYEE
    public static final String NEW_APPLICATION = "Уважаемый пользователь, в %s зарегистрирована заявка на услугу %s под номером №%s от %sг. просим взять в работу.";
    public static final String NEW_APPROVAL = "Уважаемый пользователь, в %s поступило решение на согласование на услугу %s под номером №%s от %sг. просим согласовать.";
    public static final String NEW_SIGN = "Уважаемый пользователь, в %s поступил документ %s от %sг. на утверждение, просим утвердить.";
    public static final String NEW_ASSIGN = "Уважаемый пользователь, в %s поступила заявка на услугу %s под номером №%s от %sг. просим взять в работу.";
    public static final String NEW_REVISION = "Уважаемый пользователь, в %s поступило решение на доработку по заявке №%s от %sг., просим доработать.";
    public static final String NEW_DECISION_REVISION = "Уважаемый пользователь, в %s поступил документ на доработку %s №%s от %sг., просим доработать.";

    // TO CONSUMER
    public static final String APPLICATION_REGISTERED = "Құрметті тұтынушы!\n\n" +
            "%s «Электр желілеріне қосылуға техникалық шарт беру» қызметі бойынша тіркеу нөмірі №%s болатын өтінішіңіз сәтті тіркелгенін хабарлайды. Толық ақпарат алу үшін мына сілтемеге өтіңіз isel.kz\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет вас о том, что ваше заявление с регистрационным номером №%s по услуге «Выдача технических условий на присоединение к электрическим сетям» успешно зарегистрировано. Для получения полной информации просим пройти в личный кабинет по ссылке isel.kz\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";
    public static final String TECH_RECOMMENDATION_SIGNED = "Құрметті тұтынушы!\n\n" +
            "%s «Электр желілеріне қосылуға техникалық шарт беру» қызметі бойынша өтініштің тіркеу нөмірі №%s болатын техникалық шарт дайын екендігін хабарлайды. Құжатты алу үшін сілтеме арқылы жеке кабинетке кіруіңізді сұраймыз isel.kz немесе энергия тасмалдаушы ұйымға хабарласыңыз.\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет вас о том, что технические условия по заявлению с регистрационным номером №%s по услуге «Выдача технических условий на присоединение к электрическим сетям» готово. Для получения просим пройти в личный кабинет isel.kz или обратиться в энергопередающую организацию.\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";
    public static final String REASONED_REFUSAL_SIGNED = "Құрметті тұтынушы!\n\n" +
            "%s «Электр желілеріне қосылуға техникалық шарттар беру» қызметі бойынша нөмірі №%s өтінішіңізді қарап, энергетикалық сараптамамен қызмет көрсетуден бас тарту туралы шешім қабылданғанын хабарлайды. Толық ақпарат алу үшін жеке кабинетке баруыңызды сұраймыз isel.kz немесе энергия беруші ұйымға хабарласыңыз.\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет Вас о том, что рассмотрев Ваше заявление с регистрационным номером №%s по услуге «Выдача технических условий на присоединение к электрическим сетям», энергетической экспертизой принято решение отказать в предоставлении услуги. Для получения полной информации просим пройти в личный кабинет isel.kz или обратиться в энергопередающую организацию.\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";

    // TO DP
    public static final String OFF_HOURS_KAZ = "Өтініш %s бастап өңделеді";
    public static final String OFF_HOURS_RUS = "Заявка будет отработана с %s";
}
