package kz.kus.sa.tech.condition.util;

public class Messages {

    private Messages() {
    }

    public static final String IS_NAME = "ИС \"Сервисная деятельность\"";
    public static final String TC_SERVICE_NAME_KK = "Электр желілеріне қосылуға техникалық шарт беру";
    public static final String TC_SERVICE_NAME_RU = "Выдача технических условий на присоединение к электрическим сетям";
    public static final String TC_EPO_SERVICE_NAME_KK = "ЭТМ желілері үшін техникалық шарттарды үйлестіру (қосалқы тұтынушылар үшін)";
    public static final String TC_EPO_SERVICE_NAME_RU = "Согласование Технических условий по сетям ЭПО (по субпотребителям)";
    public static final String DOC_REASONED_REFUSAL = "\"Мотивированное письмо\"";
    public static final String DOC_TC_PROJECT = "\"Технические условия на присоединение к электрическим сетям\"";
    public static final String LINK_DP = "isel.kz";
    public static final String LINK_SA = "sa.kus.kz";

    // TO EMPLOYEE
    public static final String NEW_APPLICATION = "Уважаемый пользователь, в %s зарегистрирована заявка на услугу «%s» под номером №%s от %sг. просим взять в работу.";
    public static final String NEW_APPROVAL = "Уважаемый пользователь, в %s поступило решение на согласование на услугу «%s» под номером №%s от %sг. просим согласовать.";
    public static final String NEW_SIGN = "Уважаемый пользователь, в %s поступил документ %s от %sг. на утверждение, просим утвердить.";
    public static final String NEW_ASSIGN = "Уважаемый пользователь, в %s поступила заявка на услугу «%s» под номером №%s от %sг. просим взять в работу.";
    public static final String NEW_REVISION = "Уважаемый пользователь, в %s поступило решение на доработку по заявке №%s от %sг., просим доработать.";
    public static final String NEW_DECISION_REVISION = "Уважаемый пользователь, в %s поступил документ на доработку «%s» №%s от %sг., просим доработать.";

    // TO CONSUMER
    public static final String APPLICATION_REGISTERED = "Құрметті тұтынушы!\n\n" +
            "%s «%s» қызметі бойынша тіркеу нөмірі №%s болатын өтінішіңіз сәтті тіркелгенін хабарлайды. " +
            "Толық ақпарат алу үшін мына сілтемеге өтіңіз %s\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет вас о том, что ваше заявление с регистрационным номером №%s по услуге «%s» успешно зарегистрировано. " +
            "Для получения полной информации просим пройти в личный кабинет по ссылке %s\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";
    public static final String TECH_RECOMMENDATION_SIGNED = "Құрметті тұтынушы!\n\n" +
            "%s «%s» қызметі бойынша өтініштің тіркеу нөмірі №%s болатын құжат дайын екендігін хабарлайды. " +
            "Құжатты алу үшін сілтеме арқылы жеке кабинетке кіруіңізді сұраймыз %s немесе энергия тасмалдаушы ұйымға хабарласыңыз.\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет вас о том, что документ по заявлению с регистрационным номером №%s по услуге «%s» готово. " +
            "Для получения просим пройти в личный кабинет %s или обратиться в энергопередающую организацию.\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";
    public static final String REASONED_REFUSAL_SIGNED = "Құрметті тұтынушы!\n\n" +
            "%s «%s» қызметі бойынша нөмірі №%s өтінішіңізді қарап, " +
            "энергетикалық сараптамамен қызмет көрсетуден бас тарту туралы шешім қабылданғанын хабарлайды. " +
            "Толық ақпарат алу үшін жеке кабинетке баруыңызды сұраймыз %s немесе энергия беруші ұйымға хабарласыңыз.\n\n" +
            "Уважаемый Потребитель!\n\n" +
            "%s уведомляет Вас о том, что рассмотрев Ваше заявление с регистрационным номером №%s по услуге «%s», " +
            "энергетической экспертизой принято решение отказать в предоставлении услуги. " +
            "Для получения полной информации просим пройти в личный кабинет %s или обратиться в энергопередающую организацию.\n\n" +
            "Орындаушы/Исполнитель: %s\n\n" +
            "Телефон: %s";

    // TO DP
    public static final String OFF_HOURS_KAZ = "Өтініш %s бастап өңделеді";
    public static final String OFF_HOURS_RUS = "Заявка будет отработана с %s";
}
